import { Construction, Size } from '../../../shared/idex';

export const CharacteristicSize: Size[] = [
  new Size('Высота проема, мм', '	1 000 - 3 000'),
  new Size('Ширина проема, мм', '	2 000 - 5 000'),
  new Size('Просвет, мм', '100'),
];

export const Constructions: Construction[] = [
  new Construction('Поверхность алюминиевых профилей покрыта порошковой эмалью.'
  + ' Качество покрытия полностью соответствует мировому стандарту Qualicoat.'),
  new Construction('Технологические просветы между створками ворот,'
  + ' а также между крепежными столбами и створками закрываются специальным профилем.'),
  new Construction('С внутренней стороны распашных ворот устанавливается задвижка.'),
  new Construction('Алюминиевая ручка устанавливается в полотно ворот, позволяя открывать их как с внутренней, так и с внешней стороны.'),
  new Construction('Регулируемые петли с износостойкими подшипниками.'),
  new Construction('Автономный антивандальный водонепроницаемый контроллер KEYCOD предназначен для управления одним устройством,'
  + ' также может быть использован как внешняя клавишная панель или устройство считывания карт.'),
  new Construction('Светодиодная сигнальная лампа Lamp-LED предназначена для оповещения о движении полотна ворот'
  + ' во время всего цикла открытия или закрытия. Применение светодиодных элементов сокращает энергопотребление'
  + ' и существенно увеличивает срок службы лампы.'),
  new Construction('Электромеханические приводы серии Swing — оптимальное решение для автоматизации бытовых'
  + ' и промышленных распашных ворот со средней и высокой интенсивностью использования.'
  + ' Преимуществом данных приводов является возможность их установки на узкие столбы.')
];
