export class Size {
  constructor(
    public parametr: string,
    public index: string,
  ) { }
}

export const CharacteristicSize: Size[] = [
  new Size('Комплект №1 ширина/высота проема, мм', '2500х2150'),
  new Size('Комплект №2 ширина/высота проема, мм', '2500х2280'),
  new Size('Комплект №3 ширина/высота проема, мм', '2500х2530'),
  new Size('Комплект №4 ширина/высота проема, мм', '2750х2530'),
  new Size('Комплект №5 ширина/высота проема, мм', '2750х2280'),
  new Size('Комплект №6 ширина/высота проема, мм', '3000х2030'),
  new Size('Комплект №7 ширина/высота проема, мм', '3000х2280'),
  new Size('Комплект №8 ширина/высота проема, мм', '3000х2530'),
  new Size('Комплект №9 ширина/высота проема, мм', '3000х2680'),
  new Size('Комплект №10 ширина/высота проема, мм', '3350х2150'),
];

